deniskim82/BT_HID_Proxy/sdkconfig.defaults
# BT HID Proxy - SDK Configuration Defaults
# Target: M5Stamp Pico (ESP32-PICO-D4)

# -----------------------------------
# Target Selection
# -----------------------------------
CONFIG_IDF_TARGET="esp32"

# -----------------------------------
# Bluetooth Configuration
# -----------------------------------
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_BLE_ENABLED=y

# HID Host support
CONFIG_BT_HID_HOST_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# Dual mode (Classic + BLE)
CONFIG_BTDM_CTRL_MODE_BTDM=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=n

# Bluetooth controller settings
CONFIG_BTDM_CTRL_BR_EDR_SCO_DATA_PATH_EFF=0
CONFIG_BTDM_CTRL_PCM_ROLE_EFF=0
CONFIG_BTDM_CTRL_PCM_POLAR_EFF=0
CONFIG_BTDM_CTRL_BLE_MAX_CONN=3
CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN=2
CONFIG_BTDM_CTRL_BR_EDR_MAX_SYNC_CONN=0

# Security settings
CONFIG_BT_SSP_ENABLED=y
CONFIG_BT_BLE_SMP_ENABLE=y

# GAP configuration
CONFIG_BT_GAP_ENABLED=y
CONFIG_BT_GATTC_ENABLE=y

# HID configuration
CONFIG_BT_HID_ENABLED=y

# -----------------------------------
# NVS Flash Configuration
# -----------------------------------
CONFIG_NVS_ENCRYPTION=n

# -----------------------------------
# FreeRTOS Configuration
# -----------------------------------
CONFIG_FREERTOS_HZ=1000

# -----------------------------------
# Log Level
# -----------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Reduce BT logging for performance
CONFIG_BT_LOG_HCI_TRACE_LEVEL_NONE=y
CONFIG_BT_LOG_BTM_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_SDP_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_GAP_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_BNEP_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_PAN_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_A2D_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_AVDT_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_AVCT_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_AVRC_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_MCA_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_HID_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_APPL_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_GATT_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_SMP_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_BTIF_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_BTC_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_OSI_TRACE_LEVEL_WARNING=y
CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_WARNING=y

# -----------------------------------
# Memory Optimization
# -----------------------------------
CONFIG_BT_ALLOCATION_FROM_SPIRAM_FIRST=n
CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY=n

# -----------------------------------
# UART Configuration
# -----------------------------------
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# -----------------------------------
# Watchdog
# -----------------------------------
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# -----------------------------------
# Power Management
# -----------------------------------
CONFIG_PM_ENABLE=n
